grevaillot/svd_tools/headers/STM32H743x/exti.h
#pragma once 

/* --- EXTI: External interrupt/event controller -------------------- */

/** @defgroup exti_registers External interrupt/event
      controller Register
@{*/

/** EXTI_RTSR1 EXTI rising trigger selection register **/
#define EXTI_RTSR1			MMIO32(EXTI_BASE + 0x00)
/** EXTI_FTSR1 EXTI falling trigger selection register **/
#define EXTI_FTSR1			MMIO32(EXTI_BASE + 0x04)
/** EXTI_SWIER1 EXTI software interrupt event register **/
#define EXTI_SWIER1			MMIO32(EXTI_BASE + 0x08)
/** EXTI_D3PMR1 EXTI D3 pending mask register **/
#define EXTI_D3PMR1			MMIO32(EXTI_BASE + 0x0c)
/** EXTI_D3PCR1L EXTI D3 pending clear selection register low **/
#define EXTI_D3PCR1L			MMIO32(EXTI_BASE + 0x10)
/** EXTI_D3PCR1H EXTI D3 pending clear selection register high **/
#define EXTI_D3PCR1H			MMIO32(EXTI_BASE + 0x14)
/** EXTI_RTSR2 EXTI rising trigger selection register **/
#define EXTI_RTSR2			MMIO32(EXTI_BASE + 0x20)
/** EXTI_FTSR2 EXTI falling trigger selection register **/
#define EXTI_FTSR2			MMIO32(EXTI_BASE + 0x24)
/** EXTI_SWIER2 EXTI software interrupt event register **/
#define EXTI_SWIER2			MMIO32(EXTI_BASE + 0x28)
/** EXTI_D3PMR2 EXTI D3 pending mask register **/
#define EXTI_D3PMR2			MMIO32(EXTI_BASE + 0x2c)
/** EXTI_D3PCR2L EXTI D3 pending clear selection register low **/
#define EXTI_D3PCR2L			MMIO32(EXTI_BASE + 0x30)
/** EXTI_D3PCR2H EXTI D3 pending clear selection register high **/
#define EXTI_D3PCR2H			MMIO32(EXTI_BASE + 0x34)
/** EXTI_RTSR3 EXTI rising trigger selection register **/
#define EXTI_RTSR3			MMIO32(EXTI_BASE + 0x40)
/** EXTI_FTSR3 EXTI falling trigger selection register **/
#define EXTI_FTSR3			MMIO32(EXTI_BASE + 0x44)
/** EXTI_SWIER3 EXTI software interrupt event register **/
#define EXTI_SWIER3			MMIO32(EXTI_BASE + 0x48)
/** EXTI_D3PMR3 EXTI D3 pending mask register **/
#define EXTI_D3PMR3			MMIO32(EXTI_BASE + 0x4c)
/** EXTI_D3PCR3H EXTI D3 pending clear selection register high **/
#define EXTI_D3PCR3H			MMIO32(EXTI_BASE + 0x54)
/** EXTI_CPUIMR1 EXTI interrupt mask register **/
#define EXTI_CPUIMR1			MMIO32(EXTI_BASE + 0x80)
/** EXTI_CPUEMR1 EXTI event mask register **/
#define EXTI_CPUEMR1			MMIO32(EXTI_BASE + 0x84)
/** EXTI_CPUPR1 EXTI pending register **/
#define EXTI_CPUPR1			MMIO32(EXTI_BASE + 0x88)
/** EXTI_CPUIMR2 EXTI interrupt mask register **/
#define EXTI_CPUIMR2			MMIO32(EXTI_BASE + 0x90)
/** EXTI_CPUEMR2 EXTI event mask register **/
#define EXTI_CPUEMR2			MMIO32(EXTI_BASE + 0x94)
/** EXTI_CPUPR2 EXTI pending register **/
#define EXTI_CPUPR2			MMIO32(EXTI_BASE + 0x98)
/** EXTI_CPUIMR3 EXTI interrupt mask register **/
#define EXTI_CPUIMR3			MMIO32(EXTI_BASE + 0xa0)
/** EXTI_CPUEMR3 EXTI event mask register **/
#define EXTI_CPUEMR3			MMIO32(EXTI_BASE + 0xa4)
/** EXTI_CPUPR3 EXTI pending register **/
#define EXTI_CPUPR3			MMIO32(EXTI_BASE + 0xa8)

/**@}*/


/** @defgroup exti_rtsr1 RTSR1 EXTI rising trigger selection register
@{*/

/** EXTI_RTSR1_TR21 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR21		(1 << 21)
/** EXTI_RTSR1_TR20 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR20		(1 << 20)
/** EXTI_RTSR1_TR19 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR19		(1 << 19)
/** EXTI_RTSR1_TR18 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR18		(1 << 18)
/** EXTI_RTSR1_TR17 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR17		(1 << 17)
/** EXTI_RTSR1_TR16 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR16		(1 << 16)
/** EXTI_RTSR1_TR15 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR15		(1 << 15)
/** EXTI_RTSR1_TR14 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR14		(1 << 14)
/** EXTI_RTSR1_TR13 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR13		(1 << 13)
/** EXTI_RTSR1_TR12 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR12		(1 << 12)
/** EXTI_RTSR1_TR11 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR11		(1 << 11)
/** EXTI_RTSR1_TR10 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR10		(1 << 10)
/** EXTI_RTSR1_TR9 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR9		(1 << 9)
/** EXTI_RTSR1_TR8 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR8		(1 << 8)
/** EXTI_RTSR1_TR7 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR7		(1 << 7)
/** EXTI_RTSR1_TR6 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR6		(1 << 6)
/** EXTI_RTSR1_TR5 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR5		(1 << 5)
/** EXTI_RTSR1_TR4 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR4		(1 << 4)
/** EXTI_RTSR1_TR3 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR3		(1 << 3)
/** EXTI_RTSR1_TR2 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR2		(1 << 2)
/** EXTI_RTSR1_TR1 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR1		(1 << 1)
/** EXTI_RTSR1_TR0 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR0		(1 << 0)

/**@}*/

/** @defgroup exti_ftsr1 FTSR1 EXTI falling trigger selection register
@{*/

/** EXTI_FTSR1_TR21 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR21		(1 << 21)
/** EXTI_FTSR1_TR20 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR20		(1 << 20)
/** EXTI_FTSR1_TR19 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR19		(1 << 19)
/** EXTI_FTSR1_TR18 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR18		(1 << 18)
/** EXTI_FTSR1_TR17 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR17		(1 << 17)
/** EXTI_FTSR1_TR16 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR16		(1 << 16)
/** EXTI_FTSR1_TR15 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR15		(1 << 15)
/** EXTI_FTSR1_TR14 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR14		(1 << 14)
/** EXTI_FTSR1_TR13 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR13		(1 << 13)
/** EXTI_FTSR1_TR12 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR12		(1 << 12)
/** EXTI_FTSR1_TR11 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR11		(1 << 11)
/** EXTI_FTSR1_TR10 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR10		(1 << 10)
/** EXTI_FTSR1_TR9 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR9		(1 << 9)
/** EXTI_FTSR1_TR8 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR8		(1 << 8)
/** EXTI_FTSR1_TR7 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR7		(1 << 7)
/** EXTI_FTSR1_TR6 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR6		(1 << 6)
/** EXTI_FTSR1_TR5 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR5		(1 << 5)
/** EXTI_FTSR1_TR4 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR4		(1 << 4)
/** EXTI_FTSR1_TR3 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR3		(1 << 3)
/** EXTI_FTSR1_TR2 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR2		(1 << 2)
/** EXTI_FTSR1_TR1 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR1		(1 << 1)
/** EXTI_FTSR1_TR0 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR0		(1 << 0)

/**@}*/

/** @defgroup exti_swier1 SWIER1 EXTI software interrupt event register
@{*/

/** EXTI_SWIER1_SWIER21 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER21		(1 << 21)
/** EXTI_SWIER1_SWIER20 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER20		(1 << 20)
/** EXTI_SWIER1_SWIER19 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER19		(1 << 19)
/** EXTI_SWIER1_SWIER18 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER18		(1 << 18)
/** EXTI_SWIER1_SWIER17 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER17		(1 << 17)
/** EXTI_SWIER1_SWIER16 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER16		(1 << 16)
/** EXTI_SWIER1_SWIER15 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER15		(1 << 15)
/** EXTI_SWIER1_SWIER14 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER14		(1 << 14)
/** EXTI_SWIER1_SWIER13 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER13		(1 << 13)
/** EXTI_SWIER1_SWIER12 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER12		(1 << 12)
/** EXTI_SWIER1_SWIER11 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER11		(1 << 11)
/** EXTI_SWIER1_SWIER10 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER10		(1 << 10)
/** EXTI_SWIER1_SWIER9 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER9		(1 << 9)
/** EXTI_SWIER1_SWIER8 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER8		(1 << 8)
/** EXTI_SWIER1_SWIER7 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER7		(1 << 7)
/** EXTI_SWIER1_SWIER6 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER6		(1 << 6)
/** EXTI_SWIER1_SWIER5 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER5		(1 << 5)
/** EXTI_SWIER1_SWIER4 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER4		(1 << 4)
/** EXTI_SWIER1_SWIER3 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER3		(1 << 3)
/** EXTI_SWIER1_SWIER2 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER2		(1 << 2)
/** EXTI_SWIER1_SWIER1 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER1		(1 << 1)
/** EXTI_SWIER1_SWIER0 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER0		(1 << 0)

/**@}*/

/** @defgroup exti_d3pmr1 D3PMR1 EXTI D3 pending mask register
@{*/

/** EXTI_D3PMR1_MR25 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_D3PMR1_MR25		(1 << 25)
/** EXTI_D3PMR1_MR21 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_D3PMR1_MR21		(1 << 21)
/** EXTI_D3PMR1_MR20 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_D3PMR1_MR20		(1 << 20)
/** EXTI_D3PMR1_MR19 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_D3PMR1_MR19		(1 << 19)
/** EXTI_D3PMR1_MR15 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_D3PMR1_MR15		(1 << 15)
/** EXTI_D3PMR1_MR14 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_D3PMR1_MR14		(1 << 14)
/** EXTI_D3PMR1_MR13 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_D3PMR1_MR13		(1 << 13)
/** EXTI_D3PMR1_MR12 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_D3PMR1_MR12		(1 << 12)
/** EXTI_D3PMR1_MR11 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_D3PMR1_MR11		(1 << 11)
/** EXTI_D3PMR1_MR10 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_D3PMR1_MR10		(1 << 10)
/** EXTI_D3PMR1_MR9 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_D3PMR1_MR9		(1 << 9)
/** EXTI_D3PMR1_MR8 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_D3PMR1_MR8		(1 << 8)
/** EXTI_D3PMR1_MR7 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_D3PMR1_MR7		(1 << 7)
/** EXTI_D3PMR1_MR6 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_D3PMR1_MR6		(1 << 6)
/** EXTI_D3PMR1_MR5 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_D3PMR1_MR5		(1 << 5)
/** EXTI_D3PMR1_MR4 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_D3PMR1_MR4		(1 << 4)
/** EXTI_D3PMR1_MR3 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_D3PMR1_MR3		(1 << 3)
/** EXTI_D3PMR1_MR2 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_D3PMR1_MR2		(1 << 2)
/** EXTI_D3PMR1_MR1 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_D3PMR1_MR1		(1 << 1)
/** EXTI_D3PMR1_MR0 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_D3PMR1_MR0		(1 << 0)

/**@}*/

/** @defgroup exti_d3pcr1l D3PCR1L EXTI D3 pending clear selection register low
@{*/


#define EXTI_D3PCR1L_PCS15_SHIFT		30
#define EXTI_D3PCR1L_PCS15_MASK		0x03
/** @defgroup exti_d3pcr1l_pcs15 PCS15 D3 Pending request clear input signal selection on Event input x = truncate (n/2)
@{*/
/**@}*/


#define EXTI_D3PCR1L_PCS14_SHIFT		28
#define EXTI_D3PCR1L_PCS14_MASK		0x03
/** @defgroup exti_d3pcr1l_pcs14 PCS14 D3 Pending request clear input signal selection on Event input x = truncate (n/2)
@{*/
/**@}*/


#define EXTI_D3PCR1L_PCS13_SHIFT		26
#define EXTI_D3PCR1L_PCS13_MASK		0x03
/** @defgroup exti_d3pcr1l_pcs13 PCS13 D3 Pending request clear input signal selection on Event input x = truncate (n/2)
@{*/
/**@}*/


#define EXTI_D3PCR1L_PCS12_SHIFT		24
#define EXTI_D3PCR1L_PCS12_MASK		0x03
/** @defgroup exti_d3pcr1l_pcs12 PCS12 D3 Pending request clear input signal selection on Event input x = truncate (n/2)
@{*/
/**@}*/


#define EXTI_D3PCR1L_PCS11_SHIFT		22
#define EXTI_D3PCR1L_PCS11_MASK		0x03
/** @defgroup exti_d3pcr1l_pcs11 PCS11 D3 Pending request clear input signal selection on Event input x = truncate (n/2)
@{*/
/**@}*/


#define EXTI_D3PCR1L_PCS10_SHIFT		20
#define EXTI_D3PCR1L_PCS10_MASK		0x03
/** @defgroup exti_d3pcr1l_pcs10 PCS10 D3 Pending request clear input signal selection on Event input x = truncate (n/2)
@{*/
/**@}*/


