grevaillot/svd_tools/headers/STM32H743x/exti.h
#define EXTI_D3PCR1L_PCS9_SHIFT		18
#define EXTI_D3PCR1L_PCS9_MASK		0x03
/** @defgroup exti_d3pcr1l_pcs9 PCS9 D3 Pending request clear input signal selection on Event input x = truncate (n/2)
@{*/
/**@}*/


#define EXTI_D3PCR1L_PCS8_SHIFT		16
#define EXTI_D3PCR1L_PCS8_MASK		0x03
/** @defgroup exti_d3pcr1l_pcs8 PCS8 D3 Pending request clear input signal selection on Event input x = truncate (n/2)
@{*/
/**@}*/


#define EXTI_D3PCR1L_PCS7_SHIFT		14
#define EXTI_D3PCR1L_PCS7_MASK		0x03
/** @defgroup exti_d3pcr1l_pcs7 PCS7 D3 Pending request clear input signal selection on Event input x = truncate (n/2)
@{*/
/**@}*/


#define EXTI_D3PCR1L_PCS6_SHIFT		12
#define EXTI_D3PCR1L_PCS6_MASK		0x03
/** @defgroup exti_d3pcr1l_pcs6 PCS6 D3 Pending request clear input signal selection on Event input x = truncate (n/2)
@{*/
/**@}*/


#define EXTI_D3PCR1L_PCS5_SHIFT		10
#define EXTI_D3PCR1L_PCS5_MASK		0x03
/** @defgroup exti_d3pcr1l_pcs5 PCS5 D3 Pending request clear input signal selection on Event input x = truncate (n/2)
@{*/
/**@}*/


#define EXTI_D3PCR1L_PCS4_SHIFT		8
#define EXTI_D3PCR1L_PCS4_MASK		0x03
/** @defgroup exti_d3pcr1l_pcs4 PCS4 D3 Pending request clear input signal selection on Event input x = truncate (n/2)
@{*/
/**@}*/


#define EXTI_D3PCR1L_PCS3_SHIFT		6
#define EXTI_D3PCR1L_PCS3_MASK		0x03
/** @defgroup exti_d3pcr1l_pcs3 PCS3 D3 Pending request clear input signal selection on Event input x = truncate (n/2)
@{*/
/**@}*/


#define EXTI_D3PCR1L_PCS2_SHIFT		4
#define EXTI_D3PCR1L_PCS2_MASK		0x03
/** @defgroup exti_d3pcr1l_pcs2 PCS2 D3 Pending request clear input signal selection on Event input x = truncate (n/2)
@{*/
/**@}*/


#define EXTI_D3PCR1L_PCS1_SHIFT		2
#define EXTI_D3PCR1L_PCS1_MASK		0x03
/** @defgroup exti_d3pcr1l_pcs1 PCS1 D3 Pending request clear input signal selection on Event input x = truncate (n/2)
@{*/
/**@}*/


#define EXTI_D3PCR1L_PCS0_SHIFT		0
#define EXTI_D3PCR1L_PCS0_MASK		0x03
/** @defgroup exti_d3pcr1l_pcs0 PCS0 D3 Pending request clear input signal selection on Event input x = truncate (n/2)
@{*/
/**@}*/


/**@}*/

/** @defgroup exti_d3pcr1h D3PCR1H EXTI D3 pending clear selection register high
@{*/


#define EXTI_D3PCR1H_PCS25_SHIFT		18
#define EXTI_D3PCR1H_PCS25_MASK		0x03
/** @defgroup exti_d3pcr1h_pcs25 PCS25 D3 Pending request clear input signal selection on Event input x = truncate ((n+32)/2)
@{*/
/**@}*/


#define EXTI_D3PCR1H_PCS21_SHIFT		10
#define EXTI_D3PCR1H_PCS21_MASK		0x03
/** @defgroup exti_d3pcr1h_pcs21 PCS21 D3 Pending request clear input signal selection on Event input x = truncate ((n+32)/2)
@{*/
/**@}*/


#define EXTI_D3PCR1H_PCS20_SHIFT		8
#define EXTI_D3PCR1H_PCS20_MASK		0x03
/** @defgroup exti_d3pcr1h_pcs20 PCS20 D3 Pending request clear input signal selection on Event input x = truncate ((n+32)/2)
@{*/
/**@}*/


#define EXTI_D3PCR1H_PCS19_SHIFT		6
#define EXTI_D3PCR1H_PCS19_MASK		0x03
/** @defgroup exti_d3pcr1h_pcs19 PCS19 D3 Pending request clear input signal selection on Event input x = truncate ((n+32)/2)
@{*/
/**@}*/


/**@}*/

/** @defgroup exti_rtsr2 RTSR2 EXTI rising trigger selection register
@{*/

/** EXTI_RTSR2_TR51 Rising trigger event configuration bit of Configurable Event input x+32 **/
#define EXTI_RTSR2_TR51		(1 << 19)
/** EXTI_RTSR2_TR49 Rising trigger event configuration bit of Configurable Event input x+32 **/
#define EXTI_RTSR2_TR49		(1 << 17)

/**@}*/

/** @defgroup exti_ftsr2 FTSR2 EXTI falling trigger selection register
@{*/

/** EXTI_FTSR2_TR51 Falling trigger event configuration bit of Configurable Event input x+32 **/
#define EXTI_FTSR2_TR51		(1 << 19)
/** EXTI_FTSR2_TR49 Falling trigger event configuration bit of Configurable Event input x+32 **/
#define EXTI_FTSR2_TR49		(1 << 17)

/**@}*/

/** @defgroup exti_swier2 SWIER2 EXTI software interrupt event register
@{*/

/** EXTI_SWIER2_SWIER51 Software interrupt on line x+32 **/
#define EXTI_SWIER2_SWIER51		(1 << 19)
/** EXTI_SWIER2_SWIER49 Software interrupt on line x+32 **/
#define EXTI_SWIER2_SWIER49		(1 << 17)

/**@}*/

/** @defgroup exti_d3pmr2 D3PMR2 EXTI D3 pending mask register
@{*/

/** EXTI_D3PMR2_MR53 D3 Pending Mask on Event input x+32 **/
#define EXTI_D3PMR2_MR53		(1 << 21)
/** EXTI_D3PMR2_MR52 D3 Pending Mask on Event input x+32 **/
#define EXTI_D3PMR2_MR52		(1 << 20)
/** EXTI_D3PMR2_MR51 D3 Pending Mask on Event input x+32 **/
#define EXTI_D3PMR2_MR51		(1 << 19)
/** EXTI_D3PMR2_MR50 D3 Pending Mask on Event input x+32 **/
#define EXTI_D3PMR2_MR50		(1 << 18)
/** EXTI_D3PMR2_MR49 D3 Pending Mask on Event input x+32 **/
#define EXTI_D3PMR2_MR49		(1 << 17)
/** EXTI_D3PMR2_MR48 D3 Pending Mask on Event input x+32 **/
#define EXTI_D3PMR2_MR48		(1 << 16)
/** EXTI_D3PMR2_MR41 D3 Pending Mask on Event input x+32 **/
#define EXTI_D3PMR2_MR41		(1 << 9)
/** EXTI_D3PMR2_MR35 D3 Pending Mask on Event input x+32 **/
#define EXTI_D3PMR2_MR35		(1 << 3)
/** EXTI_D3PMR2_MR34 D3 Pending Mask on Event input x+32 **/
#define EXTI_D3PMR2_MR34		(1 << 2)

/**@}*/

/** @defgroup exti_d3pcr2l D3PCR2L EXTI D3 pending clear selection register low
@{*/


#define EXTI_D3PCR2L_PCS41_SHIFT		18
#define EXTI_D3PCR2L_PCS41_MASK		0x03
/** @defgroup exti_d3pcr2l_pcs41 PCS41 D3 Pending request clear input signal selection on Event input x = truncate ((n+64)/2)
@{*/
/**@}*/


#define EXTI_D3PCR2L_PCS35_SHIFT		6
#define EXTI_D3PCR2L_PCS35_MASK		0x03
/** @defgroup exti_d3pcr2l_pcs35 PCS35 D3 Pending request clear input signal selection on Event input x = truncate ((n+64)/2)
@{*/
/**@}*/


#define EXTI_D3PCR2L_PCS34_SHIFT		4
#define EXTI_D3PCR2L_PCS34_MASK		0x03
/** @defgroup exti_d3pcr2l_pcs34 PCS34 D3 Pending request clear input signal selection on Event input x = truncate ((n+64)/2)
@{*/
/**@}*/


/**@}*/

/** @defgroup exti_d3pcr2h D3PCR2H EXTI D3 pending clear selection register high
@{*/


#define EXTI_D3PCR2H_PCS53_SHIFT		10
#define EXTI_D3PCR2H_PCS53_MASK		0x03
/** @defgroup exti_d3pcr2h_pcs53 PCS53 Pending request clear input signal selection on Event input x= truncate ((n+96)/2)
@{*/
/**@}*/


#define EXTI_D3PCR2H_PCS52_SHIFT		8
#define EXTI_D3PCR2H_PCS52_MASK		0x03
/** @defgroup exti_d3pcr2h_pcs52 PCS52 Pending request clear input signal selection on Event input x= truncate ((n+96)/2)
@{*/
/**@}*/


#define EXTI_D3PCR2H_PCS51_SHIFT		6
#define EXTI_D3PCR2H_PCS51_MASK		0x03
/** @defgroup exti_d3pcr2h_pcs51 PCS51 Pending request clear input signal selection on Event input x= truncate ((n+96)/2)
@{*/
/**@}*/


