grevaillot/svd_tools/headers/STM32H743x/exti.h
#define EXTI_D3PCR2H_PCS50_SHIFT		4
#define EXTI_D3PCR2H_PCS50_MASK		0x03
/** @defgroup exti_d3pcr2h_pcs50 PCS50 Pending request clear input signal selection on Event input x= truncate ((n+96)/2)
@{*/
/**@}*/


#define EXTI_D3PCR2H_PCS49_SHIFT		2
#define EXTI_D3PCR2H_PCS49_MASK		0x03
/** @defgroup exti_d3pcr2h_pcs49 PCS49 Pending request clear input signal selection on Event input x= truncate ((n+96)/2)
@{*/
/**@}*/


#define EXTI_D3PCR2H_PCS48_SHIFT		0
#define EXTI_D3PCR2H_PCS48_MASK		0x03
/** @defgroup exti_d3pcr2h_pcs48 PCS48 Pending request clear input signal selection on Event input x= truncate ((n+96)/2)
@{*/
/**@}*/


/**@}*/

/** @defgroup exti_rtsr3 RTSR3 EXTI rising trigger selection register
@{*/

/** EXTI_RTSR3_TR86 Rising trigger event configuration bit of Configurable Event input x+64 **/
#define EXTI_RTSR3_TR86		(1 << 22)
/** EXTI_RTSR3_TR85 Rising trigger event configuration bit of Configurable Event input x+64 **/
#define EXTI_RTSR3_TR85		(1 << 21)
/** EXTI_RTSR3_TR84 Rising trigger event configuration bit of Configurable Event input x+64 **/
#define EXTI_RTSR3_TR84		(1 << 20)
/** EXTI_RTSR3_TR82 Rising trigger event configuration bit of Configurable Event input x+64 **/
#define EXTI_RTSR3_TR82		(1 << 18)

/**@}*/

/** @defgroup exti_ftsr3 FTSR3 EXTI falling trigger selection register
@{*/

/** EXTI_FTSR3_TR86 Falling trigger event configuration bit of Configurable Event input x+64 **/
#define EXTI_FTSR3_TR86		(1 << 22)
/** EXTI_FTSR3_TR85 Falling trigger event configuration bit of Configurable Event input x+64 **/
#define EXTI_FTSR3_TR85		(1 << 21)
/** EXTI_FTSR3_TR84 Falling trigger event configuration bit of Configurable Event input x+64 **/
#define EXTI_FTSR3_TR84		(1 << 20)
/** EXTI_FTSR3_TR82 Falling trigger event configuration bit of Configurable Event input x+64 **/
#define EXTI_FTSR3_TR82		(1 << 18)

/**@}*/

/** @defgroup exti_swier3 SWIER3 EXTI software interrupt event register
@{*/

/** EXTI_SWIER3_SWIER86 Software interrupt on line x+64 **/
#define EXTI_SWIER3_SWIER86		(1 << 22)
/** EXTI_SWIER3_SWIER85 Software interrupt on line x+64 **/
#define EXTI_SWIER3_SWIER85		(1 << 21)
/** EXTI_SWIER3_SWIER84 Software interrupt on line x+64 **/
#define EXTI_SWIER3_SWIER84		(1 << 20)
/** EXTI_SWIER3_SWIER82 Software interrupt on line x+64 **/
#define EXTI_SWIER3_SWIER82		(1 << 18)

/**@}*/

/** @defgroup exti_d3pmr3 D3PMR3 EXTI D3 pending mask register
@{*/

/** EXTI_D3PMR3_MR88 D3 Pending Mask on Event input x+64 **/
#define EXTI_D3PMR3_MR88		(1 << 24)

/**@}*/

/** @defgroup exti_d3pcr3h D3PCR3H EXTI D3 pending clear selection register high
@{*/


#define EXTI_D3PCR3H_PCS88_SHIFT		18
#define EXTI_D3PCR3H_PCS88_MASK		0x03
/** @defgroup exti_d3pcr3h_pcs88 PCS88 D3 Pending request clear input signal selection on Event input x= truncate N+160/2
@{*/
/**@}*/


/**@}*/

/** @defgroup exti_cpuimr1 CPUIMR1 EXTI interrupt mask register
@{*/

/** EXTI_CPUIMR1_MR31 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_CPUIMR1_MR31		(1 << 31)
/** EXTI_CPUIMR1_MR30 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_CPUIMR1_MR30		(1 << 30)
/** EXTI_CPUIMR1_MR29 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_CPUIMR1_MR29		(1 << 29)
/** EXTI_CPUIMR1_MR28 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_CPUIMR1_MR28		(1 << 28)
/** EXTI_CPUIMR1_MR27 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_CPUIMR1_MR27		(1 << 27)
/** EXTI_CPUIMR1_MR26 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_CPUIMR1_MR26		(1 << 26)
/** EXTI_CPUIMR1_MR25 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_CPUIMR1_MR25		(1 << 25)
/** EXTI_CPUIMR1_MR24 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_CPUIMR1_MR24		(1 << 24)
/** EXTI_CPUIMR1_MR23 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_CPUIMR1_MR23		(1 << 23)
/** EXTI_CPUIMR1_MR22 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_CPUIMR1_MR22		(1 << 22)
/** EXTI_CPUIMR1_MR21 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_CPUIMR1_MR21		(1 << 21)
/** EXTI_CPUIMR1_MR20 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_CPUIMR1_MR20		(1 << 20)
/** EXTI_CPUIMR1_MR19 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_CPUIMR1_MR19		(1 << 19)
/** EXTI_CPUIMR1_MR18 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_CPUIMR1_MR18		(1 << 18)
/** EXTI_CPUIMR1_MR17 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_CPUIMR1_MR17		(1 << 17)
/** EXTI_CPUIMR1_MR16 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_CPUIMR1_MR16		(1 << 16)
/** EXTI_CPUIMR1_MR15 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_CPUIMR1_MR15		(1 << 15)
/** EXTI_CPUIMR1_MR14 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_CPUIMR1_MR14		(1 << 14)
/** EXTI_CPUIMR1_MR13 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_CPUIMR1_MR13		(1 << 13)
/** EXTI_CPUIMR1_MR12 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_CPUIMR1_MR12		(1 << 12)
/** EXTI_CPUIMR1_MR11 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_CPUIMR1_MR11		(1 << 11)
/** EXTI_CPUIMR1_MR10 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_CPUIMR1_MR10		(1 << 10)
/** EXTI_CPUIMR1_MR9 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_CPUIMR1_MR9		(1 << 9)
/** EXTI_CPUIMR1_MR8 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_CPUIMR1_MR8		(1 << 8)
/** EXTI_CPUIMR1_MR7 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_CPUIMR1_MR7		(1 << 7)
/** EXTI_CPUIMR1_MR6 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_CPUIMR1_MR6		(1 << 6)
/** EXTI_CPUIMR1_MR5 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_CPUIMR1_MR5		(1 << 5)
/** EXTI_CPUIMR1_MR4 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_CPUIMR1_MR4		(1 << 4)
/** EXTI_CPUIMR1_MR3 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_CPUIMR1_MR3		(1 << 3)
/** EXTI_CPUIMR1_MR2 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_CPUIMR1_MR2		(1 << 2)
/** EXTI_CPUIMR1_MR1 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_CPUIMR1_MR1		(1 << 1)
/** EXTI_CPUIMR1_MR0 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_CPUIMR1_MR0		(1 << 0)

/**@}*/

/** @defgroup exti_cpuemr1 CPUEMR1 EXTI event mask register
@{*/

/** EXTI_CPUEMR1_MR31 CPU Event mask on Event input x **/
#define EXTI_CPUEMR1_MR31		(1 << 31)
/** EXTI_CPUEMR1_MR30 CPU Event mask on Event input x **/
#define EXTI_CPUEMR1_MR30		(1 << 30)
/** EXTI_CPUEMR1_MR29 CPU Event mask on Event input x **/
#define EXTI_CPUEMR1_MR29		(1 << 29)
/** EXTI_CPUEMR1_MR28 CPU Event mask on Event input x **/
#define EXTI_CPUEMR1_MR28		(1 << 28)
/** EXTI_CPUEMR1_MR27 CPU Event mask on Event input x **/
#define EXTI_CPUEMR1_MR27		(1 << 27)
/** EXTI_CPUEMR1_MR26 CPU Event mask on Event input x **/
#define EXTI_CPUEMR1_MR26		(1 << 26)
/** EXTI_CPUEMR1_MR25 CPU Event mask on Event input x **/
#define EXTI_CPUEMR1_MR25		(1 << 25)
/** EXTI_CPUEMR1_MR24 CPU Event mask on Event input x **/
#define EXTI_CPUEMR1_MR24		(1 << 24)
/** EXTI_CPUEMR1_MR23 CPU Event mask on Event input x **/
#define EXTI_CPUEMR1_MR23		(1 << 23)
/** EXTI_CPUEMR1_MR22 CPU Event mask on Event input x **/
#define EXTI_CPUEMR1_MR22		(1 << 22)
/** EXTI_CPUEMR1_MR21 CPU Event mask on Event input x **/
#define EXTI_CPUEMR1_MR21		(1 << 21)
/** EXTI_CPUEMR1_MR20 CPU Event mask on Event input x **/
#define EXTI_CPUEMR1_MR20		(1 << 20)
/** EXTI_CPUEMR1_MR19 CPU Event mask on Event input x **/
#define EXTI_CPUEMR1_MR19		(1 << 19)
/** EXTI_CPUEMR1_MR18 CPU Event mask on Event input x **/
#define EXTI_CPUEMR1_MR18		(1 << 18)
/** EXTI_CPUEMR1_MR17 CPU Event mask on Event input x **/
#define EXTI_CPUEMR1_MR17		(1 << 17)
/** EXTI_CPUEMR1_MR16 CPU Event mask on Event input x **/
#define EXTI_CPUEMR1_MR16		(1 << 16)
/** EXTI_CPUEMR1_MR15 CPU Event mask on Event input x **/
#define EXTI_CPUEMR1_MR15		(1 << 15)
/** EXTI_CPUEMR1_MR14 CPU Event mask on Event input x **/
#define EXTI_CPUEMR1_MR14		(1 << 14)
/** EXTI_CPUEMR1_MR13 CPU Event mask on Event input x **/
#define EXTI_CPUEMR1_MR13		(1 << 13)
/** EXTI_CPUEMR1_MR12 CPU Event mask on Event input x **/
#define EXTI_CPUEMR1_MR12		(1 << 12)
/** EXTI_CPUEMR1_MR11 CPU Event mask on Event input x **/
#define EXTI_CPUEMR1_MR11		(1 << 11)
/** EXTI_CPUEMR1_MR10 CPU Event mask on Event input x **/
#define EXTI_CPUEMR1_MR10		(1 << 10)
/** EXTI_CPUEMR1_MR9 CPU Event mask on Event input x **/
#define EXTI_CPUEMR1_MR9		(1 << 9)
/** EXTI_CPUEMR1_MR8 CPU Event mask on Event input x **/
#define EXTI_CPUEMR1_MR8		(1 << 8)
/** EXTI_CPUEMR1_MR7 CPU Event mask on Event input x **/
#define EXTI_CPUEMR1_MR7		(1 << 7)
/** EXTI_CPUEMR1_MR6 CPU Event mask on Event input x **/
#define EXTI_CPUEMR1_MR6		(1 << 6)
/** EXTI_CPUEMR1_MR5 CPU Event mask on Event input x **/
#define EXTI_CPUEMR1_MR5		(1 << 5)
/** EXTI_CPUEMR1_MR4 CPU Event mask on Event input x **/
#define EXTI_CPUEMR1_MR4		(1 << 4)
/** EXTI_CPUEMR1_MR3 CPU Event mask on Event input x **/
#define EXTI_CPUEMR1_MR3		(1 << 3)
/** EXTI_CPUEMR1_MR2 CPU Event mask on Event input x **/
#define EXTI_CPUEMR1_MR2		(1 << 2)
/** EXTI_CPUEMR1_MR1 CPU Event mask on Event input x **/
#define EXTI_CPUEMR1_MR1		(1 << 1)
/** EXTI_CPUEMR1_MR0 CPU Event mask on Event input x **/
#define EXTI_CPUEMR1_MR0		(1 << 0)

/**@}*/

/** @defgroup exti_cpupr1 CPUPR1 EXTI pending register
@{*/

/** EXTI_CPUPR1_PR21 CPU Event mask on Event input x **/
#define EXTI_CPUPR1_PR21		(1 << 21)
/** EXTI_CPUPR1_PR20 CPU Event mask on Event input x **/
#define EXTI_CPUPR1_PR20		(1 << 20)
/** EXTI_CPUPR1_PR19 CPU Event mask on Event input x **/
#define EXTI_CPUPR1_PR19		(1 << 19)
/** EXTI_CPUPR1_PR18 CPU Event mask on Event input x **/
#define EXTI_CPUPR1_PR18		(1 << 18)
/** EXTI_CPUPR1_PR17 CPU Event mask on Event input x **/
#define EXTI_CPUPR1_PR17		(1 << 17)
/** EXTI_CPUPR1_PR16 CPU Event mask on Event input x **/
#define EXTI_CPUPR1_PR16		(1 << 16)
/** EXTI_CPUPR1_PR15 CPU Event mask on Event input x **/
#define EXTI_CPUPR1_PR15		(1 << 15)
/** EXTI_CPUPR1_PR14 CPU Event mask on Event input x **/
#define EXTI_CPUPR1_PR14		(1 << 14)
/** EXTI_CPUPR1_PR13 CPU Event mask on Event input x **/
#define EXTI_CPUPR1_PR13		(1 << 13)
/** EXTI_CPUPR1_PR12 CPU Event mask on Event input x **/
#define EXTI_CPUPR1_PR12		(1 << 12)
/** EXTI_CPUPR1_PR11 CPU Event mask on Event input x **/
#define EXTI_CPUPR1_PR11		(1 << 11)
/** EXTI_CPUPR1_PR10 CPU Event mask on Event input x **/
#define EXTI_CPUPR1_PR10		(1 << 10)
/** EXTI_CPUPR1_PR9 CPU Event mask on Event input x **/
#define EXTI_CPUPR1_PR9		(1 << 9)
/** EXTI_CPUPR1_PR8 CPU Event mask on Event input x **/
#define EXTI_CPUPR1_PR8		(1 << 8)
/** EXTI_CPUPR1_PR7 CPU Event mask on Event input x **/
#define EXTI_CPUPR1_PR7		(1 << 7)
/** EXTI_CPUPR1_PR6 CPU Event mask on Event input x **/
#define EXTI_CPUPR1_PR6		(1 << 6)
/** EXTI_CPUPR1_PR5 CPU Event mask on Event input x **/
#define EXTI_CPUPR1_PR5		(1 << 5)
/** EXTI_CPUPR1_PR4 CPU Event mask on Event input x **/
#define EXTI_CPUPR1_PR4		(1 << 4)
/** EXTI_CPUPR1_PR3 CPU Event mask on Event input x **/
#define EXTI_CPUPR1_PR3		(1 << 3)
/** EXTI_CPUPR1_PR2 CPU Event mask on Event input x **/
#define EXTI_CPUPR1_PR2		(1 << 2)
/** EXTI_CPUPR1_PR1 CPU Event mask on Event input x **/
#define EXTI_CPUPR1_PR1		(1 << 1)
/** EXTI_CPUPR1_PR0 CPU Event mask on Event input x **/
#define EXTI_CPUPR1_PR0		(1 << 0)

/**@}*/

