grevaillot/svd_tools/headers/STM32H743x/exti.h
/** @defgroup exti_cpuimr2 CPUIMR2 EXTI interrupt mask register
@{*/

/** EXTI_CPUIMR2_MR31 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUIMR2_MR31		(1 << 31)
/** EXTI_CPUIMR2_MR30 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUIMR2_MR30		(1 << 30)
/** EXTI_CPUIMR2_MR29 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUIMR2_MR29		(1 << 29)
/** EXTI_CPUIMR2_MR28 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUIMR2_MR28		(1 << 28)
/** EXTI_CPUIMR2_MR27 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUIMR2_MR27		(1 << 27)
/** EXTI_CPUIMR2_MR26 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUIMR2_MR26		(1 << 26)
/** EXTI_CPUIMR2_MR25 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUIMR2_MR25		(1 << 25)
/** EXTI_CPUIMR2_MR24 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUIMR2_MR24		(1 << 24)
/** EXTI_CPUIMR2_MR23 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUIMR2_MR23		(1 << 23)
/** EXTI_CPUIMR2_MR22 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUIMR2_MR22		(1 << 22)
/** EXTI_CPUIMR2_MR21 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUIMR2_MR21		(1 << 21)
/** EXTI_CPUIMR2_MR20 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUIMR2_MR20		(1 << 20)
/** EXTI_CPUIMR2_MR19 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUIMR2_MR19		(1 << 19)
/** EXTI_CPUIMR2_MR18 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUIMR2_MR18		(1 << 18)
/** EXTI_CPUIMR2_MR17 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUIMR2_MR17		(1 << 17)
/** EXTI_CPUIMR2_MR16 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUIMR2_MR16		(1 << 16)
/** EXTI_CPUIMR2_MR15 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUIMR2_MR15		(1 << 15)
/** EXTI_CPUIMR2_MR14 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUIMR2_MR14		(1 << 14)
/** EXTI_CPUIMR2_MR12 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUIMR2_MR12		(1 << 12)
/** EXTI_CPUIMR2_MR11 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUIMR2_MR11		(1 << 11)
/** EXTI_CPUIMR2_MR10 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUIMR2_MR10		(1 << 10)
/** EXTI_CPUIMR2_MR9 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUIMR2_MR9		(1 << 9)
/** EXTI_CPUIMR2_MR8 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUIMR2_MR8		(1 << 8)
/** EXTI_CPUIMR2_MR7 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUIMR2_MR7		(1 << 7)
/** EXTI_CPUIMR2_MR6 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUIMR2_MR6		(1 << 6)
/** EXTI_CPUIMR2_MR5 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUIMR2_MR5		(1 << 5)
/** EXTI_CPUIMR2_MR4 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUIMR2_MR4		(1 << 4)
/** EXTI_CPUIMR2_MR3 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUIMR2_MR3		(1 << 3)
/** EXTI_CPUIMR2_MR2 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUIMR2_MR2		(1 << 2)
/** EXTI_CPUIMR2_MR1 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUIMR2_MR1		(1 << 1)
/** EXTI_CPUIMR2_MR0 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUIMR2_MR0		(1 << 0)

/**@}*/

/** @defgroup exti_cpuemr2 CPUEMR2 EXTI event mask register
@{*/

/** EXTI_CPUEMR2_MR63 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUEMR2_MR63		(1 << 31)
/** EXTI_CPUEMR2_MR62 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUEMR2_MR62		(1 << 30)
/** EXTI_CPUEMR2_MR61 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUEMR2_MR61		(1 << 29)
/** EXTI_CPUEMR2_MR60 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUEMR2_MR60		(1 << 28)
/** EXTI_CPUEMR2_MR59 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUEMR2_MR59		(1 << 27)
/** EXTI_CPUEMR2_MR58 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUEMR2_MR58		(1 << 26)
/** EXTI_CPUEMR2_MR57 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUEMR2_MR57		(1 << 25)
/** EXTI_CPUEMR2_MR56 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUEMR2_MR56		(1 << 24)
/** EXTI_CPUEMR2_MR55 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUEMR2_MR55		(1 << 23)
/** EXTI_CPUEMR2_MR54 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUEMR2_MR54		(1 << 22)
/** EXTI_CPUEMR2_MR53 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUEMR2_MR53		(1 << 21)
/** EXTI_CPUEMR2_MR52 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUEMR2_MR52		(1 << 20)
/** EXTI_CPUEMR2_MR51 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUEMR2_MR51		(1 << 19)
/** EXTI_CPUEMR2_MR50 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUEMR2_MR50		(1 << 18)
/** EXTI_CPUEMR2_MR49 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUEMR2_MR49		(1 << 17)
/** EXTI_CPUEMR2_MR48 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUEMR2_MR48		(1 << 16)
/** EXTI_CPUEMR2_MR47 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUEMR2_MR47		(1 << 15)
/** EXTI_CPUEMR2_MR46 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUEMR2_MR46		(1 << 14)
/** EXTI_CPUEMR2_MR44 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUEMR2_MR44		(1 << 12)
/** EXTI_CPUEMR2_MR43 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUEMR2_MR43		(1 << 11)
/** EXTI_CPUEMR2_MR42 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUEMR2_MR42		(1 << 10)
/** EXTI_CPUEMR2_MR41 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUEMR2_MR41		(1 << 9)
/** EXTI_CPUEMR2_MR40 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUEMR2_MR40		(1 << 8)
/** EXTI_CPUEMR2_MR39 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUEMR2_MR39		(1 << 7)
/** EXTI_CPUEMR2_MR38 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUEMR2_MR38		(1 << 6)
/** EXTI_CPUEMR2_MR37 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUEMR2_MR37		(1 << 5)
/** EXTI_CPUEMR2_MR36 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUEMR2_MR36		(1 << 4)
/** EXTI_CPUEMR2_MR35 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUEMR2_MR35		(1 << 3)
/** EXTI_CPUEMR2_MR34 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUEMR2_MR34		(1 << 2)
/** EXTI_CPUEMR2_MR33 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUEMR2_MR33		(1 << 1)
/** EXTI_CPUEMR2_MR32 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_CPUEMR2_MR32		(1 << 0)

/**@}*/

/** @defgroup exti_cpupr2 CPUPR2 EXTI pending register
@{*/

/** EXTI_CPUPR2_PR51 Configurable event inputs x+32 Pending bit **/
#define EXTI_CPUPR2_PR51		(1 << 19)
/** EXTI_CPUPR2_PR49 Configurable event inputs x+32 Pending bit **/
#define EXTI_CPUPR2_PR49		(1 << 17)

/**@}*/

/** @defgroup exti_cpuimr3 CPUIMR3 EXTI interrupt mask register
@{*/

/** EXTI_CPUIMR3_MR88 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_CPUIMR3_MR88		(1 << 24)
/** EXTI_CPUIMR3_MR87 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_CPUIMR3_MR87		(1 << 23)
/** EXTI_CPUIMR3_MR86 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_CPUIMR3_MR86		(1 << 22)
/** EXTI_CPUIMR3_MR85 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_CPUIMR3_MR85		(1 << 21)
/** EXTI_CPUIMR3_MR84 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_CPUIMR3_MR84		(1 << 20)
/** EXTI_CPUIMR3_MR82 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_CPUIMR3_MR82		(1 << 18)
/** EXTI_CPUIMR3_MR80 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_CPUIMR3_MR80		(1 << 16)
/** EXTI_CPUIMR3_MR79 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_CPUIMR3_MR79		(1 << 15)
/** EXTI_CPUIMR3_MR78 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_CPUIMR3_MR78		(1 << 14)
/** EXTI_CPUIMR3_MR77 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_CPUIMR3_MR77		(1 << 13)
/** EXTI_CPUIMR3_MR76 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_CPUIMR3_MR76		(1 << 12)
/** EXTI_CPUIMR3_MR75 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_CPUIMR3_MR75		(1 << 11)
/** EXTI_CPUIMR3_MR74 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_CPUIMR3_MR74		(1 << 10)
/** EXTI_CPUIMR3_MR73 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_CPUIMR3_MR73		(1 << 9)
/** EXTI_CPUIMR3_MR72 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_CPUIMR3_MR72		(1 << 8)
/** EXTI_CPUIMR3_MR71 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_CPUIMR3_MR71		(1 << 7)
/** EXTI_CPUIMR3_MR70 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_CPUIMR3_MR70		(1 << 6)
/** EXTI_CPUIMR3_MR69 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_CPUIMR3_MR69		(1 << 5)
/** EXTI_CPUIMR3_MR68 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_CPUIMR3_MR68		(1 << 4)
/** EXTI_CPUIMR3_MR67 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_CPUIMR3_MR67		(1 << 3)
/** EXTI_CPUIMR3_MR66 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_CPUIMR3_MR66		(1 << 2)
/** EXTI_CPUIMR3_MR65 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_CPUIMR3_MR65		(1 << 1)
/** EXTI_CPUIMR3_MR64 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_CPUIMR3_MR64		(1 << 0)

/**@}*/

/** @defgroup exti_cpuemr3 CPUEMR3 EXTI event mask register
@{*/

/** EXTI_CPUEMR3_MR88 CPU Event mask on Event input x+64 **/
#define EXTI_CPUEMR3_MR88		(1 << 24)
/** EXTI_CPUEMR3_MR87 CPU Event mask on Event input x+64 **/
#define EXTI_CPUEMR3_MR87		(1 << 23)
/** EXTI_CPUEMR3_MR86 CPU Event mask on Event input x+64 **/
#define EXTI_CPUEMR3_MR86		(1 << 22)
/** EXTI_CPUEMR3_MR85 CPU Event mask on Event input x+64 **/
#define EXTI_CPUEMR3_MR85		(1 << 21)
/** EXTI_CPUEMR3_MR84 CPU Event mask on Event input x+64 **/
#define EXTI_CPUEMR3_MR84		(1 << 20)
/** EXTI_CPUEMR3_MR82 CPU Event mask on Event input x+64 **/
#define EXTI_CPUEMR3_MR82		(1 << 18)
/** EXTI_CPUEMR3_MR80 CPU Event mask on Event input x+64 **/
#define EXTI_CPUEMR3_MR80		(1 << 16)
/** EXTI_CPUEMR3_MR79 CPU Event mask on Event input x+64 **/
#define EXTI_CPUEMR3_MR79		(1 << 15)
/** EXTI_CPUEMR3_MR78 CPU Event mask on Event input x+64 **/
#define EXTI_CPUEMR3_MR78		(1 << 14)
/** EXTI_CPUEMR3_MR77 CPU Event mask on Event input x+64 **/
#define EXTI_CPUEMR3_MR77		(1 << 13)
/** EXTI_CPUEMR3_MR76 CPU Event mask on Event input x+64 **/
#define EXTI_CPUEMR3_MR76		(1 << 12)
/** EXTI_CPUEMR3_MR75 CPU Event mask on Event input x+64 **/
#define EXTI_CPUEMR3_MR75		(1 << 11)
/** EXTI_CPUEMR3_MR74 CPU Event mask on Event input x+64 **/
#define EXTI_CPUEMR3_MR74		(1 << 10)
/** EXTI_CPUEMR3_MR73 CPU Event mask on Event input x+64 **/
#define EXTI_CPUEMR3_MR73		(1 << 9)
/** EXTI_CPUEMR3_MR72 CPU Event mask on Event input x+64 **/
#define EXTI_CPUEMR3_MR72		(1 << 8)
/** EXTI_CPUEMR3_MR71 CPU Event mask on Event input x+64 **/
#define EXTI_CPUEMR3_MR71		(1 << 7)
/** EXTI_CPUEMR3_MR70 CPU Event mask on Event input x+64 **/
#define EXTI_CPUEMR3_MR70		(1 << 6)
/** EXTI_CPUEMR3_MR69 CPU Event mask on Event input x+64 **/
#define EXTI_CPUEMR3_MR69		(1 << 5)
/** EXTI_CPUEMR3_MR68 CPU Event mask on Event input x+64 **/
#define EXTI_CPUEMR3_MR68		(1 << 4)
/** EXTI_CPUEMR3_MR67 CPU Event mask on Event input x+64 **/
#define EXTI_CPUEMR3_MR67		(1 << 3)
/** EXTI_CPUEMR3_MR66 CPU Event mask on Event input x+64 **/
#define EXTI_CPUEMR3_MR66		(1 << 2)
/** EXTI_CPUEMR3_MR65 CPU Event mask on Event input x+64 **/
#define EXTI_CPUEMR3_MR65		(1 << 1)
/** EXTI_CPUEMR3_MR64 CPU Event mask on Event input x+64 **/
#define EXTI_CPUEMR3_MR64		(1 << 0)

/**@}*/

/** @defgroup exti_cpupr3 CPUPR3 EXTI pending register
@{*/

/** EXTI_CPUPR3_PR86 Configurable event inputs x+64 Pending bit **/
#define EXTI_CPUPR3_PR86		(1 << 22)
/** EXTI_CPUPR3_PR85 Configurable event inputs x+64 Pending bit **/
#define EXTI_CPUPR3_PR85		(1 << 21)
/** EXTI_CPUPR3_PR84 Configurable event inputs x+64 Pending bit **/
#define EXTI_CPUPR3_PR84		(1 << 20)
/** EXTI_CPUPR3_PR82 Configurable event inputs x+64 Pending bit **/
#define EXTI_CPUPR3_PR82		(1 << 18)

/**@}*/
